module.exports.config = {
    name: "war2",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "... - Long LTD",
    description: "War nÃ¡t cÃ¡i boxchat",
  usePrefix:true,
    commandCategory: "group",
    usages: "war Ä‘áº­m cháº¥t",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("বন্ধু আমি রমিম তোরে চুদতে এসে পরছি😘");
setTimeout(() => {a({body: "দয়া করে পরে গালাগালি কইরো না, এখন একটু শান্তিতে চুদতে দাও" })}, 3000);
setTimeout(() => {a({body: "ফিজ নাকি লাম্বা তর মার বুদায় দিমু আমার ১২কাটার খাম্বা,❎কিরে ফকিন্নি মাগী, মুরগী তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী,,তুর্কীকে আছে নাকি তোর মামু,,তোর  কচি ভোদা আমি কামরাই কামরাই খামু"})}, 5000);
setTimeout(() => {a({body: "তোর মা বোনের ভোদায় শুটকি মাছের গন্ধ তোর মায়ের চুইদা অনলাইনের করমু অন্ধ" })}, 7000);
setTimeout(() => {a({body: "অন্ধ হইয়া অনলাইনে করবি ভিহ্মা তোর মায়ের চুইদা অনলাইনে দিমু শিহ্মা?" })}, 9000);
setTimeout(() => {a({body: "তোমার কেউ টেক্সট দিয়ে বিরক্ত করো না,, তাকে পাট হ্মেতে চুদা হচ্ছে।" })}, 12000);
setTimeout(() => {a({body: "রমিম কে গালি চুদাস মাগির পোলা খাংকির পোলা খাংকির পোলা তর মাইরে চুদি খাংকির পোলা" })}, 15000);
setTimeout(() => {a({body: "আমি  রমিম 👉করলাম শুরু তোর মার পুটকিতে ডুকামু ২টা গরু গরু নাকি ডাকে হাম্বা  তোর মার ভোদায় ডুকামু ২টা ইলেক্ট্রিকের খাম্বা🗼🗼" })}, 17000);
setTimeout(() => {a({body: "কিরে ফকিন্নি মাগীর পোলা,মুরগী তোর মায়ের চুদতে চুদতে নিয়া যামু তুর্কী,,তুর্কীকে আছে নাকি কী মামু,,তোর বোনের কচি ভুদা কামড়াইয়া খামু 🌽" })}, 20000);
setTimeout(() => {a({body: "তোর মা বোনের ভোদায় শুটকি মাছের গন্ধ তোর মায়ের চুইদা অনলাইনের করমু অন্ধ" })}, 23000);
setTimeout(() => {a({body: "আমি গালি জানি না গালি গেছি ভুইলা তোর মায়ের চুদমু ছায়া বেলাউুজ খুইলা,,তোর আবাল জাতের মাইরে চুদি খাংকির পোলা" })}, 25000);
setTimeout(() => {a({body: "খাংকির পোলা তোর সাথে আড়ি তোর মায়েরে চুদতে চুদতে নিয়া যামু নানার বাড়ি,,সেখানে আছে ছাগল তোর মায়েরে চুদে রাস্তা রাম ছাগল,,ছাগলের আছে নাকি  পশম,,তোর মায়ের ভোদার শয়তানের কসম বান্দির বাচ্ছা" })}, 28500);
setTimeout(() => {a({body: "এই মুরগি শুন তর আম্মু রে চুদি আচার এর লোভ দেখিয়ে চুদি🌶" })}, 31000);
setTimeout(() => {a({body: "তর মত গালি বাজ আমি ৩৬৫ দিন চুদি মাগির পোলা" })}, 36000);
setTimeout(() => {a({body: "এই খানকি মাগীর পোলা, বুস্কি মাগির পোলা, তোর মারে চুদে,তুই ফকিন্নি মাগির পোলা কার সাথে লাগতে আসছস" })}, 39000);
setTimeout(() => {a({body: "এই মুরগি খাংকির পোলা হামিদ তর আম্মুর ভাতার লাগে বাস্ট্রাডের বাচ্ছা গালি বাজ হয়ে গেসিস😤 " })}, 40000);
setTimeout(() => {a({body: "আমি এখন লন্ডনে তোর মায়ের চুদমু বিনা কনডেম,,চুদতে চুদতে কনডম গেলো ফাটইয়া তোর মায়ের ভোদা মধ্যে যামু হাইটা শুয়ারের বাচ্চা😈" })}, 65000);
setTimeout(() => {a({body: "নডি মাগির পুত তোর বইনের মাসিক চাইটা চাইটা খা👅" })}, 70000);
setTimeout(() => {a({body: "বুস্কি মাগির পোলা হামিদ তোর রিয়েল পাপ্পা ভাতিজা 🥱" })}, 75000);
setTimeout(() => {a({body: "ওয়ান টু থিরি তোর মায়ের ভোদা মধ্যে ধরাইলাম বিড়ি বিড়িতে নাই আগুন,,তোর মায়ের ভোদা মধ্যে দিমু বেগুন বেগুনে নাই বিচি তোর মায়েরচুদি মাগির পোলা 🌚" })}, 80000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের কিং তোর মায়ের ভোদা মধ্যে বাজামু সাপের বিন,,বিনের তালে তালে চুদতে চুদতে নিয়া যামু খালে খালে নাই সাপ আমি হামিদ তোর অবৈধ বাপ" })}, 85000);
setTimeout(() => {a("রাম চুদলাম লক্ষন চুদলাম চুদলাম হনুমান তোর মায়েরে অনলাইনে চুইদা হইছি গালিবাজ শুয়ারের বাচ্চা")} , 90000);
setTimeout(() => {a({body: "DNA টেস্ট কর দেখবি আমার চুদাতেই তর জন্ম💦" })}, 95000);
setTimeout(() => {a({body: "কিরে বস্তির পোলা তর আম্মু রে তর দুলাভাই এর কান্দে ফেলে আর তর কচি বোন রে তর বাপের কান্দে রেখে চুদি উফফফ" })}, 100000);
setTimeout(() => {a({body: "তোর মার সাওয়ার ভিতর লিখে দিলাম আমি রমিম তর আব্বু..!😘" })}, 105000);
setTimeout(() => {a({body: "বাই বাই বন্ধু, আবার চুদার ফিলিন্স উটলে চুদতে আসবো 👅"})} , 115000);




  
   }