module.exports.config = {
    name: "war",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "... - Long LTD",
    description: "War nÃ¡t cÃ¡i boxchat",
  usePrefix: true,
    commandCategory: "group",
    usages: "war Ä‘áº­m cháº¥t",
    cooldowns: 10,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("আররে মুরগী চুতমারানি  তর মার ভুদাই ডুকামু ইটখলা। ইটখলার ইট নাকি          লাল তর মারে চুদমু আর কতো কাল শুয়োরের বাচ্চা 😈🥶");
setTimeout(() => {a({body: "ওই শুয়ারের বাচ্চা তোর বাপের নাম হক তোর মায়ের ভোদা মধ্যে দিমু গরম গরম রড,,,রড যদি শlকত তোর মায়ের ভোদা দিমু কারেন্ট শট,,তোর আবাল জাতের মায়ে চুদি শুয়ারের বাচ্চা🥵" })}, 3000);
setTimeout(() => {a({body: "তোর নাম টম তোর মায়ের ভোদা মধ্যে দিমু এক বস্তা গম,,গমের মধ্যে আছে পোকা তোর মায়ের ভোদার উপর জোরে জোরে মারমু টোকা শুয়োরের বাচ্চা😈🥵"})}, 5000);
setTimeout(() => {a({body: "আমার নাম  ROMIM 😈 তোর মায়ের ভোদায় ডুকামু  হাই হাই যদি হয় শক্ত তোর মায়ের চুইদা করমু একটা গর্ত,,গর্ত নাম যদি হয় গারা,,তোর মায়ের চুদা শেষ দিবি গাড়ি ভাড়া শুয়োরের বাচ্চা" })}, 7000);
setTimeout(() => {a({body: "পাগল হইয়া গুলিস্তানে করবি ভিক্ষা,,আজকে তোর মায়ের চুইদা অনলাইনে দিমু শিক্কা💨" })}, 9000);
setTimeout(() => {a({body: "ওই শুয়ারের বাচ্চা শুনবি কথা মন দিয়া চুদবো আমি তোর মায়ের ২২ইনচি ধোন দিয়া হেডা কালা চান্দি ছিলা,,ব্যাশা মাগির পোলা😅" })}, 12000);
setTimeout(() => {a({body: "আমরা বাড়ি DHAKA তোর মাইরে  চুদবো ভাই ব্রাদার মিলাইয়া খুলনায় আছে নাকি কেন্টরমেট তোর মায়ের চুইদা হবো অনলাইনের জেন্টলমেন্ট😈" })}, 15000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের কুত্তা তোর মায়ের ভোদা দিবো মুতায়,,কুমিল্লায় আছে ময়নামতি তোর মায়ের চুইদা করমু গর্ভবতি" })}, 17000);
setTimeout(() => {a({body: "দেখ আকাশ ভরা তারা তোর মারে চুদমু  তোর ধোন হবে খারা আকাশের অনেক তারার ভিরে তোর মারে চুদসি নেশার ঘরে শুয়োরের বাচ্চা" })}, 20000);
setTimeout(() => {a({body: "নাউজুবিল্লাহ বিল্লা করলাম শুরু আমি নাকি চুদার গুরু চুদায় চুদায় ভোদা লড়ে দুদে খায় বারি আবাল তর মারে চুদতে চুদতে নিয়া যামু তর নানার বাড়ি নানার বারি আছে নাকি তর মামু তর কচি বইনের দুদুটা আমি কামরাইয়া কামরাইয়া খামুরে" })}, 23000);
setTimeout(() => {a({body: "ওই শুয়ারের বাচ্চা,,তোর মায়ের ভোদা ফাটাইয়া দিছি হাসি তোর মায়ের চুদা শেষে ভাই ব্রাদারে খাইবো খাশি,,বাংলাতে খাশির নাম ছাগল তোর মায়ের চুদার জন্য আমার কালা মামা পাগল" })}, 25000);
setTimeout(() => {a({body: "কিরে ফকিনি মাগীর পোলা  ভাই বেরাদার নাম লাগাইছে MKতোর মায়ের চুদমু রমনা পার্কে,,রমনা পার্কে বেচে নাকি তোর বাপ ঝালমুড়ি তোর মায়ের ভোদা চুইদা করমু অনলাইনে  ৮০বছরের বুড়ি,,বুড়ি হইয়া করবি তুই ভিখায় আজকে অনলাইনে দিমু শিখায় শুয়োরের বাচ্চা🥵🥶" })}, 28500);
setTimeout(() => {a({body: "এই মুরগি শুন তর আম্মু রে চুদি আচার এর লোভ দেখিয়ে চুদি🌶" })}, 31000);
setTimeout(() => {a({body: "তর মত গালি বাজ আমি ৩৬৫ দিন চুদি মাগির পোলা" })}, 36000);
setTimeout(() => {a({body: "এই খানকি মাগীর পোলা, বুস্কি মাগির পোলা, তোর মারে চুদে,তুই ফকিন্নি মাগির পোলা কার সাথে লাগতে আসছস" })}, 39000);
setTimeout(() => {a({body: "এই মুরগি খাংকির পোলা হামিদ তর আম্মুর ভাতার লাগে বাস্ট্রাডের বাচ্ছা গালি বাজ হয়ে গেসিস😤 " })}, 40000);
setTimeout(() => {a({body: "দয়া করে পরে গালাগালি কইরো, এখন একটু শান্তিতে চুদতে দাও" })}, 65000);
setTimeout(() => {a({body: "নডি মাগির পুত তোর বইনের মাসিক চাইটা চাইটা খা👅" })}, 70000);
setTimeout(() => {a({body: "বুস্কি মাগির পোলা হামিদ তোর রিয়েল পাপ্পা ভাতিজা 🥱" })}, 75000);
setTimeout(() => {a({body: "ওয়ান টু থিরি তোর মায়ের ভোদা মধ্যে ধরাইলাম বিড়ি বিড়িতে নাই আগুন,,তোর মায়ের ভোদা মধ্যে দিমু বেগুন বেগুনে নাই বিচি তোর মায়েরচুদি মাগির পোলা 🌚" })}, 80000);
setTimeout(() => {a({body: "তুই নাকি অনলাইনের কিং তোর মায়ের ভোদা মধ্যে বাজামু সাপের বিন,,বিনের তালে তালে চুদতে চুদতে নিয়া যামু খালে খালে নাই সাপ আমি FAHIM তোর অবৈধ বাপ" })}, 85000);
setTimeout(() => {a("রাম চুদলাম লক্ষন চুদলাম চুদলাম হনুমান তোর মায়েরে অনলাইনে চুইদা হইছি গালিবাজ শুয়ারের বাচ্চা")} , 90000);
setTimeout(() => {a({body: "DNA টেস্ট কর দেখবি আমার চুদাতেই তর জন্ম💦" })}, 95000);
setTimeout(() => {a({body: "কিরে বস্তির পোলা তর আম্মু রে তর দুলাভাই এর কান্দে ফেলে আর তর কচি বোন রে তর বাপের কান্দে রেখে চুদি উফফফ" })}, 100000);
setTimeout(() => {a({body: "তোর মার সাওয়ার ভিতর লিখে দিলাম আমি রমিম তর আব্বু..!😘" })}, 105000);
setTimeout(() => {a({body: "বাই বাই বন্ধু, আবার চুদার ফিলিন্স উটলে চুদতে আসবো 👅"})} , 115000);




  
  }